Obligatorio1/Central_Midd/src/main/resources/META-INF/integration/inputXML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.middleware.fing.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:recepcionPagos>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <fechaCobro>26/02/3050 10:50</fechaCobro>
            <!--Optional:-->
            <formaPago>E</formaPago>
            <identificadorCliente>767676</identificadorCliente>
            <numeroSucursal>87556</numeroSucursal>
            <!--Zero or more repetitions:-->
            <pagos>
               <!--Optional:-->
               <codigoMoneda>UYU</codigoMoneda>
               <!--Zero or more repetitions:-->
               <datoAdicional>carlos se caga</datoAdicional>
               <identificadorPago>23123</identificadorPago>
               <monto>656</monto>
               <!--Optional:-->
               <nombreGestion>Factura</nombreGestion>
            </pagos>
           

         </arg0>
      </ser:recepcionPagos>
   </soapenv:Body>
</soapenv:Envelope>
